openfoam/day1/poiseuille-80/system/probes
// -*- C++ -*-

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (U);
probeLocations
(
    (0 1 0)
);


// ************************************************************************* //
